namespace LB3.Models
{
    public class DataViewModel
    {
        public double Isx_F { get; set; } // Заданная длина полос проката
        public int Isx_R { get; set; } // Всего необходимо изготовить

        #region A1

        public double A1_ChZag { get; set; } // Площадь поверхности заготовки 1
        public int A1_ChZag1 { get; set; } // Количество заготовок на 1-е изделие по первому способу раскроя
        public int A1_ChZag2 { get; set; } // Количество заготовок на 1-е изделие по второму способу раскроя
        public int A1_ChZag3 { get; set; } // Количество заготовок на 1-е изделие по третьему способу раскроя
        public int A1_ChZag4 { get; set; } // Количество заготовок на 1-е изделие по четвёртому способу раскроя
        public int A1_ChZag5 { get; set; } // Количество заготовок на 1-е изделие по пятому способу раскроя
        public int A1_ChZag6 { get; set; } // Количество заготовок на 1-е изделие по шестому способу раскроя
        public int A1_ChZagO { get; set; } // Количество заготовок на 1-е изделие, шт

        #endregion

        #region A2

        public double A2_ChZag { get; set; } // Площадь поверхности заготовки 2
        public int A2_ChZag1 { get; set; } // Количество заготовок на 2-е изделие по первому способу раскроя
        public int A2_ChZag2 { get; set; } // Количество заготовок на 2-е изделие по второму способу раскроя
        public int A2_ChZag3 { get; set; } // Количество заготовок на 2-е изделие по третьему способу раскроя
        public int A2_ChZag4 { get; set; } // Количество заготовок на 2-е изделие по четвёртому способу раскроя
        public int A2_ChZag5 { get; set; } // Количество заготовок на 2-е изделие по пятому способу раскроя
        public int A2_ChZag6 { get; set; } // Количество заготовок на 2-е изделие по шестому способу раскроя
        public int A2_ChZagO { get; set; } // Количество заготовок на 2-е изделие, шт

        #endregion

        #region A3

        public double A3_ChZag { get; set; } // Площадь поверхности заготовки 3
        public int A3_ChZag1 { get; set; } // Количество заготовок на 3-е изделие по первому способу раскроя
        public int A3_ChZag2 { get; set; } // Количество заготовок на 3-е изделие по второму способу раскроя
        public int A3_ChZag3 { get; set; } // Количество заготовок на 3-е изделие по третьему способу раскроя
        public int A3_ChZag4 { get; set; } // Количество заготовок на 3-е изделие по четвёртому способу раскроя
        public int A3_ChZag5 { get; set; } // Количество заготовок на 3-е изделие по пятому способу раскроя
        public int A3_ChZag6 { get; set; } // Количество заготовок на 3-е изделие по шестому способу раскроя
        public int A3_ChZagO { get; set; } // Количество заготовок на 3-е изделие, шт

        #endregion

        #region A4

        public double A4_ChZag { get; set; } // Площадь поверхности заготовки 4
        public int A4_ChZag1 { get; set; } // Количество заготовок на 4-е изделие по первому способу раскроя
        public int A4_ChZag2 { get; set; } // Количество заготовок на 4-е изделие по второму способу раскроя
        public int A4_ChZag3 { get; set; } // Количество заготовок на 4-е изделие по третьему способу раскроя
        public int A4_ChZag4 { get; set; } // Количество заготовок на 4-е изделие по четвёртому способу раскроя
        public int A4_ChZag5 { get; set; } // Количество заготовок на 4-е изделие по пятому способу раскроя
        public int A4_ChZag6 { get; set; } // Количество заготовок на 4-е изделие по шестому способу раскроя
        public int A4_ChZagO { get; set; } // Количество заготовок на 4-е изделие, шт

        #endregion

        #region A5

        public double A5_ChZag { get; set; } // Площадь поверхности заготовки 5
        public int A5_ChZag1 { get; set; } // Количество заготовок на 5-е изделие по первому способу раскроя
        public int A5_ChZag2 { get; set; } // Количество заготовок на 5-е изделие по второму способу раскроя
        public int A5_ChZag3 { get; set; } // Количество заготовок на 5-е изделие по третьему способу раскроя
        public int A5_ChZag4 { get; set; } // Количество заготовок на 5-е изделие по четвёртому способу раскроя
        public int A5_ChZag5 { get; set; } // Количество заготовок на 5-е изделие по пятому способу раскроя
        public int A5_ChZag6 { get; set; } // Количество заготовок на 5-е изделие по шестому способу раскроя
        public int A5_ChZagO { get; set; } // Количество заготовок на 5-е изделие, шт

        #endregion

        #region A6

        public double A6_ChZag { get; set; } // Площадь поверхности заготовки 5
        public int A6_ChZag1 { get; set; } // Количество заготовок на 5-е изделие по первому способу раскроя
        public int A6_ChZag2 { get; set; } // Количество заготовок на 5-е изделие по второму способу раскроя
        public int A6_ChZag3 { get; set; } // Количество заготовок на 5-е изделие по третьему способу раскроя
        public int A6_ChZag4 { get; set; } // Количество заготовок на 5-е изделие по четвёртому способу раскроя
        public int A6_ChZag5 { get; set; } // Количество заготовок на 5-е изделие по пятому способу раскроя
        public int A6_ChZag6 { get; set; } // Количество заготовок на 5-е изделие по шестому способу раскроя
        public int A6_ChZagO { get; set; } // Количество заготовок на 5-е изделие, шт

        #endregion
    }
}
